Kaynnnnnnn/S32K_K25.1_L-Minh-Hi-u/Assignmnt_01_V2/include/driver_port.h
#ifndef DRIVER_PORT_H_
#define DRIVER_PORT_H_

#include <stdint.h>
#include "S32K144.h" /* hoặc header MCU tương ứng nếu bạn đã có */

#define DRIVER_PORT_COUNT   (5U) /* A,B,C,D,E */

typedef enum {
    DRIVER_PORTA = 0,
    DRIVER_PORTB,
    DRIVER_PORTC,
    DRIVER_PORTD,
    DRIVER_PORTE
} Driver_PortInstance;

/* Mux type — có thể mở rộng nếu cần */
typedef uint8_t Driver_PortMux;
#define DRIVER_PORT_MUX_GPIO   (1U)

/* IRQ config enum (tên giống code của bạn) */
typedef enum {
    DRIVER_PORT_IRQ_DISABLED = 0U,
    DRIVER_PORT_IRQ_RISING_EDGE,
    DRIVER_PORT_IRQ_FAILING_EDGE,
    DRIVER_PORT_IRQ_EITHER_EDGE
} Driver_PortIrqConfig;

/* Callback type expected by your driver_port.c */
typedef void (*Driver_PortCallback)(Driver_PortInstance port, uint8_t pin);

/* Prototypes — bạn cần implement trong driver_port.c */
void DRIVER_PORT_EnableClock(Driver_PortInstance port);
void DRIVER_PORT_PinMux(Driver_PortInstance port, uint8_t pin, Driver_PortMux mux);
void DRIVER_PORT_PullConfig(Driver_PortInstance port, uint8_t pin, uint8_t enable, uint8_t pull_up);
void DRIVER_PORT_PinInterruptConfig(Driver_PortInstance port, uint8_t pin, Driver_PortIrqConfig config);
void DRIVER_PORT_RegisterCallback(Driver_PortInstance port, Driver_PortCallback cb);

#endif /* DRIVER_PORT_H_ */
